      * ----------------------------------------------------------------
      * Generated copybook for outerSample
      * ----------------------------------------------------------------
       01  outerSample.
           03  innerSample.
             05  R-string PIC X(32).
      * ----------------------------------------------------------------
      * Generated copybook for innerSample
      * ----------------------------------------------------------------
       01  innerSample.
           03  R-string PIC X(32).
