      * ----------------------------------------------------------------
      * Generated copybook for dateSample
      * ----------------------------------------------------------------
       01  dateSample.
           03  calendar PIC X(32).
           03  R-date PIC X(32).
