      * ----------------------------------------------------------------
      * Generated copybook for simple
      * ----------------------------------------------------------------
       01  simple.
           03  aField PIC X(32).
