      * ----------------------------------------------------------------
      * Generated copybook for customer
      * ----------------------------------------------------------------
       01  customer.
           03  name PIC X(40).
           03  R-number PIC S9(9) COMP-5.
