      * ----------------------------------------------------------------
      * Generated copybook for body
      * ----------------------------------------------------------------
       01  body.
           03  tickerSymbol PIC X(32).
      * ----------------------------------------------------------------
      * Generated copybook for bodyTradePrice
      * ----------------------------------------------------------------
       01  bodyTradePrice.
           03  price COMP-1.
